Hi all, I've just tested my existing code with the new 1.2.6 provider.  While its certainly improved, it's still trying to do an in-place update after the VRF lite configuration has been applied.

```
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following
symbols:
  ~ update in-place

Terraform will perform the following actions:

  # dcnm_vrf.vrf-1 will be updated in-place
  ~ resource "dcnm_vrf" "vrf-1" {
        id                      = "TERRAFORM-VRF1"
        name                    = "TERRAFORM-VRF1"
        # (18 unchanged attributes hidden)

      - attachments {
          - attach        = true -> null
          - loopback_id   = 0 -> null
          - serial_number = "91SFWWNMXSF" -> null
          - vlan_id       = 111 -> null

          - vrf_lite {
              - auto_vrf_lite_flag = "false" -> null
              - dot1q_id           = "11" -> null
              - interface_name     = "Ethernet1/5" -> null
              - neighbor_asn       = "65010" -> null
              - neighbor_ip        = "192.168.254.246" -> null
              - peer_vrf_name      = "global" -> null
            }
        }
      - attachments {
          - attach        = true -> null
          - loopback_id   = 0 -> null
          - serial_number = "9ERUTSZCIML" -> null
          - vlan_id       = 111 -> null

          - vrf_lite {
              - auto_vrf_lite_flag = "false" -> null
              - dot1q_id           = "11" -> null
              - interface_name     = "Ethernet1/5" -> null
              - neighbor_asn       = "65010" -> null
              - neighbor_ip        = "192.168.254.250" -> null
              - peer_vrf_name      = "global" -> null
            }
        }
      - attachments {
          - attach        = true -> null
          - loopback_id   = 0 -> null
          - serial_number = "9HUS1PPKLYO" -> null
          - vlan_id       = 111 -> null

          - vrf_lite {
              - auto_vrf_lite_flag = "false" -> null
              - dot1q_id           = "11" -> null
              - interface_name     = "Ethernet1/5" -> null
              - neighbor_asn       = "65010" -> null
              - neighbor_ip        = "192.168.254.246" -> null
              - peer_vrf_name      = "global" -> null
            }
        }
      - attachments {
          - attach        = true -> null
          - loopback_id   = 0 -> null
          - serial_number = "9ME62JQOXIB" -> null
          - vlan_id       = 111 -> null

          - vrf_lite {
              - auto_vrf_lite_flag = "false" -> null
              - dot1q_id           = "11" -> null
              - interface_name     = "Ethernet1/5" -> null
              - neighbor_asn       = "65010" -> null
              - neighbor_ip        = "192.168.254.254" -> null
              - peer_vrf_name      = "global" -> null
            }
        }
      + attachments {
          + attach           = true
          + extension_values = (known after apply)
          + free_form_config = (known after apply)
          + loopback_id      = (known after apply)
          + loopback_ipv4    = (known after apply)
          + loopback_ipv6    = (known after apply)
          + serial_number    = "91SFWWNMXSF"
          + vlan_id          = 111

          + vrf_lite {
              + auto_vrf_lite_flag = "false"
              + dot1q_id           = "11"
              + interface_name     = "Ethernet1/5"
              + ip_mask            = "192.168.254.241/30"
              + neighbor_asn       = "65010"
              + neighbor_ip        = "192.168.254.242"
              + peer_vrf_name      = "global"
            }
        }
      + attachments {
          + attach           = true
          + extension_values = (known after apply)
          + free_form_config = (known after apply)
          + loopback_id      = (known after apply)
          + loopback_ipv4    = (known after apply)
          + loopback_ipv6    = (known after apply)
          + serial_number    = "9ERUTSZCIML"
          + vlan_id          = 111

          + vrf_lite {
              + auto_vrf_lite_flag = "false"
              + dot1q_id           = "11"
              + interface_name     = "Ethernet1/5"
              + ip_mask            = "192.168.254.249/30"
              + neighbor_asn       = "65010"
              + neighbor_ip        = "192.168.254.250"
              + peer_vrf_name      = "global"
            }
        }
      + attachments {
          + attach           = true
          + extension_values = (known after apply)
          + free_form_config = (known after apply)
          + loopback_id      = (known after apply)
          + loopback_ipv4    = (known after apply)
          + loopback_ipv6    = (known after apply)
          + serial_number    = "9HUS1PPKLYO"
          + vlan_id          = 111

          + vrf_lite {
              + auto_vrf_lite_flag = "false"
              + dot1q_id           = "11"
              + interface_name     = "Ethernet1/5"
              + ip_mask            = "192.168.254.245/30"
              + neighbor_asn       = "65010"
              + neighbor_ip        = "192.168.254.246"
              + peer_vrf_name      = "global"
            }
        }
      + attachments {
          + attach           = true
          + extension_values = (known after apply)
          + free_form_config = (known after apply)
          + loopback_id      = (known after apply)
          + loopback_ipv4    = (known after apply)
          + loopback_ipv6    = (known after apply)
          + serial_number    = "9ME62JQOXIB"
          + vlan_id          = 111

          + vrf_lite {
              + auto_vrf_lite_flag = "false"
              + dot1q_id           = "11"
              + interface_name     = "Ethernet1/5"
              + ip_mask            = "192.168.254.253/30"
              + neighbor_asn       = "65010"
              + neighbor_ip        = "192.168.254.254"
              + peer_vrf_name      = "global"
            }
        }

        # (4 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: 

```